{
  "backend/main.mo": "Motoko backend storing per‑principal high scores and returning sorted leaderboard entries.",
  "feature_evidence.json": "Feature evidence report mapping features to related source files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose and functionality.",
  "frontend/index.css": "Tailwind base styles with theme color variables and dark-mode overrides.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component controlling game flow between start, play, game‑over, and leaderboard screens.",
  "frontend/src/features/auth/AuthControls.tsx": "Authentication UI using Internet Identity with sign‑in/out handling and principal display.",
  "frontend/src/features/game/gamePhysics.ts": "Pure physics utilities for runner movement, jumping, lane switching, obstacle updates, and difficulty scaling.",
  "frontend/src/features/game/RunnerGame.tsx": "Canvas-based endless runner implementing physics, obstacle spawning, collision detection, and scoring.",
  "frontend/src/features/game/types.ts": "Type definitions for runner state, obstacles, and game configuration.",
  "frontend/src/features/game/useGameLoop.ts": "Custom hook providing a requestAnimationFrame loop with delta‑time handling.",
  "frontend/src/features/game/useRunnerControls.ts": "Defines a hook that listens for keyboard input to trigger jump and lane-switch actions when active.",
  "frontend/src/features/leaderboard/LeaderboardSection.tsx": "Renders the leaderboard UI, fetching top scores and showing user status, loading, and error states.",
  "frontend/src/features/leaderboard/queries.ts": "Provides React Query hooks for fetching best score, leaderboard data, and submitting new scores via the backend actor.",
  "frontend/src/features/ui/GameOverScreen.tsx": "Displays the game-over UI, auto-submits the score for logged-in users, and shows submission status and actions.",
  "frontend/src/features/ui/Hud.tsx": "Shows the live score and, if logged in, the user's best score with loading and fallback states.",
  "frontend/src/features/ui/StartScreen.tsx": "Displays the start screen with game instructions and buttons to start the game or view the leaderboard.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity changes and invalidates dependent queries accordingly.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, exposing identity state, login, and logout functions.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for a light/dark theme and adds base styles including a pixelated canvas utility.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, rendering the main App component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, typography, plugins, and theme extensions tied to CSS variables.",
  "project_state.json": "Stores project metadata including features, requirements, pending requests, and versioned project state."
}